[
    {
        "name": "Aniela Eddy",
        "pic": "images/founders/aniela.jpg",
        "bio": "Swiss – American violinist Aniela Eddy has performed throughout the United States and Europe. Recent collaborations include performances with CityMusic Cleveland and Terence Blanchard at the Tri-C Jazz Festival, Ensemble LPR, Apollo’s Fire, All of the Above Ensemble, Five One Experimental Orchestra, One Found Sound and the Knights Chamber Orchestra. In addition to performances broadcast on Cleveland’s WCLV and New York City’s WQXR, Aniela has appeared live on NPR with A Prairie Home Companion and Garrison Keillor. She is a graduate of the San Francisco Conservatory of Music and the Cleveland Institute of Music and is currently pursuing a graduate degree in historical performance at The Juilliard School."
    },
    {
        "name": "Cullen O'Neil",
        "pic": "images/founders/cullen.jpg",
        "bio": "Cullen O'Neil is a New York City-based cellist originally from Kalamazoo, MI. Performances have brought her across North America and Europe to venues such as Alice Tully Hall, the Kennedy Center, Mariinsky Hall in St. Petersburg, The Great Hall of the Moscow Conservatory, Royal Albert Hall as part of the BBC Proms, the Helsinki Musiikkitalo, and the Philharmonie de Paris alongside Les Arts Florissants. In 2021 she was inducted as a Fellow of The English Concert in America and in 2022 became a member of Boston Baroque. Cullen is also a founding member of Quartet Salonnières, a New York-based historical quartet, and Nuova Pratica, an ensemble of historically-inspired composer/performers.\nCullen graduated from The Juilliard School in 2021 with a master's degree in historical performance. Previously, she earned degrees in both cello and music theory from the University of Michigan, where she studied with Richard Aaron. She spent the 2017-2018 school year at the Sibelius Academy in Helsinki studying with Raimo Sariola."
    },
    {
        "name": "Kako Miura",
        "pic": "images/founders/kako.jpg",
        "bio": "Originally from Tokyo and currently based in New York City, Kako Miura has performed internationally as a soloist with orchestras in Asia, Australia and the United States. Her solo and chamber music performances have taken her to a number of high-profile venues, including Alice Tully Hall at Lincoln Center, Weill and Zankel Halls at Carnegie Hall and the Sydney Opera House.\nAccording to Performance Music Conductor and Director Cheryl Y. Boga, \"The stunning virtuosity of Ms. Miura’s performances mesmerizes our audiences and students every time she is here. We are delighted to welcome her back to our hall along with two of her colleagues.\"\nThe recipient of numerous accolades, Miura took first prize in the Nagano International Music Festival Violin Competition, Bergen Philharmonic Orchestra’s Young Artists Competition, and Sound Symphony Orchestra’s Solo Competition. She also received the National YoungArts Foundation Award.\nLong committed to community engagement and music education, Miura has worked extensively with the Music Advancement Program of The Juilliard School’s Preparatory Division, teaching violin and courses on historical performance and curricular studies. In 2019, as part of Juilliard’s Young People’s Concerts series, she conceived, directed and performed \"A Day in the Life of a King,\" an original interactive concert centered around Baroque music, for elementary school students in New York City.\nMiura earned a Bachelor of Music from Juilliard, where she also attended the Pre-College Program, and a Master of Music from The Colburn School. She’s now pursuing another graduate degree in historical performance at Juilliard under the guidance of Cynthia Roberts, Elizabeth Blumenstock and Robert Mealy. She’s also studied under Robert Lipsett and Masao Kawasaki."
    },
    {
        "name": "Natalie Kress",
        "pic": "images/founders/natalie.jpg",
        "bio": "Praised by the New York Times for her “splendid playing,” Natalie Kress enjoys a varied career as a Baroque violinist in Washington, D.C. Following three summers as a Tanglewood Fellow, she was awarded the Jules C. Reiner Violin Prize and performed with Yo Yo Ma and Pamela Frank at the Kennedy Center. She performs with The Handel and Haydn Society, Shanghai Camerata, La Grande Bande, Les Arts Florissants, Philharmonia Baroque Orchestra, Juilliard415, and is a founding member of the period string quartet Quartet Salonnières. Natalie is co-founder of Musicivic Inc., a non-profit supporting local chamber music series nationwide."
    },
    {
        "name": "Rebecca Nelson",
        "pic": "images/founders/rebecca.jpg",
        "bio": "Rebecca Nelson (she/her/hers) is a songwriter from Gera, Germany. Born into a family of classical musicians, she began practicing violin at age four and absorbed a healthy diet of Bach, Phil Collins, and Gillian Welch. After earning her Bachelor’s at Rice University and a Master’s at the University of Oklahoma, Rebecca diverged from her classical violin training, diving head first into the enchanting world of Historical Performance. Through her new love of baroque music and old love of folk and bluegrass, Rebecca found her voice as a composer. Since graduating from The Juilliard School’s Historical Performance program, she has joined and founded exciting new ensembles including Nuova Pratica and Digital Camerata. Her debut album Do Not Lament will be released later this year. Aside from writing and performing music, Rebecca enjoys taking long naps with her cat, Momo, and salsa dancing."
    },
    {
        "name": "Toma Iliev",
        "pic": "images/founders/toma_portrait.jpg",
        "bio": "Toma Iliev (violin) began his musical studies at the age of four when, inspired by his older sister’s example, he started taking piano lessons. But at the age of six sibling rivalry led him to another instrument - the violin. Growing up Toma was fascinated by Antonio Vivaldi’s music - specifically the violin and bassoon concerti - which he listened to on vinyl before it was cool. His passion for early music led Toma to Indiana University where he was introduced to the baroque violin by Stanley Ritchie, and later to the Juilliard School’s Historical Performance program. Toma enjoys a vibrant career as a soloist, chamber, and orchestral musician. He regularly performs with leading early music ensembles including Handel and Haydn Society, Philharmonia Baroque Orchestra, American Bach Soloists, and Portland Baroque Orchestra. Toma is a core member of Sonnambula who served as the Metropolitan Museum of Art’s 2018-19 Ensemble in Residence, and he recently appeared with Joyce DiDonato and Il Pomo d’Oro for performances across the United States and Canada. Toma holds several honors and awards, most notably the Leipzig International Bach Competition’s 2014 Christa Bach-Marschall Foundation Prize, and the 2021 Jeffrey Thomas award. When not performing Toma can be found hiking, trail running, and mushroom hunting in the verdant forests of the Pacific Northwest."
    }
]