[
    {
        "name": "Aniela Eddy",
        "title": "Co-founder & violinist",
        "pic": "images/musicians/aniela_sq.webp",
        "bio": "Aniela Eddy's broad and varied interest in music of all eras has led to projects spanning the baroque through contemporary time periods. Recent and upcoming collaborations include performances with Apollo's Fire, TENET, Philharmonia Baroque Orchestra, Handel and Haydn Society, Voices of Music, as well as festival appearances at the Göttingen International Handel Festival, Carmel Bach Festival, Lucerne Festival, Caramoor, Ravinia, and Caroga Lake Music Festival. Aniela has appeared live on NPR with A Prairie Home Companion and Garrison Keillor. She is a founding member of Quartet Salonnières and is a graduate of the San Francisco Conservatory of Music, Cleveland Institute of Music and The Juilliard School."
    },
    {
        "name": "Cullen O'Neil",
        "title": "Co-founder & cellist",
        "pic": "images/musicians/cullen_sq.webp",
        "bio": "Cullen O'Neil is a New York City-based cellist originally from Kalamazoo, MI. Performances have brought her across North America and Europe to venues such as Alice Tully Hall, the Kennedy Center, Mariinsky Hall in St. Petersburg, The Great Hall of the Moscow Conservatory, Royal Albert Hall as part of the BBC Proms, the Helsinki Musiikkitalo, and the Philharmonie de Paris alongside Les Arts Florissants. In 2021 she was inducted as a Fellow of The English Concert in America and in 2022 became a member of Boston Baroque. Cullen is also a founding member of Quartet Salonnières, a New York-based historical quartet, and Nuova Pratica, an ensemble of historically-inspired composer/performers.\nCullen graduated from The Juilliard School in 2021 with a master's degree in historical performance. Previously, she earned degrees in both cello and music theory from the University of Michigan, where she studied with Richard Aaron. She spent the 2017-2018 school year at the Sibelius Academy in Helsinki studying with Raimo Sariola."
    },
    {
        "name": "Kako Miura",
        "title": "Co-founder & violinist",
        "pic": "images/musicians/kako_sq.webp",
        "bio": "Originally from Tokyo, Japan and now based in New York, NY, Kako Miura is a violinist who performs on both historical and modern instruments. Kako has appeared internationally as a soloist, performing alongside orchestras in Asia, Australia, and the United States, and her solo and chamber music performances have taken her to such distinguished venues as Alice Tully Hall of Lincoln Center, Weill and Zankel Halls at Carnegie Hall, and the Sydney Opera House. Also sought after as an orchestral musician, Kako most recently led Juilliard415, The Juilliard School's period orchestra, as concertmaster on a recent tour of Germany in collaboration with Yale Schola Cantorum. She is the recipient of numerous awards, including a National YoungArts Foundation Award, The English Concert in America Fellowship, and The Mercury-Juilliard Fellowship. Deeply committed to community engagement and music education, Kako has worked extensively with the Music Advancement Program, a department of The Juilliard School’s Preparatory Division, offering instruction on violin and chamber music as well as courses on historical performance and curricular studies. Her principal teachers have included Cynthia Roberts, Elizabeth Blumenstock, Robert Lipsett, and Masao Kawasaki. In addition to music, Kako loves food, tea, and naps."
    },
    {
        "name": "Natalie Rose Kress",
        "title": "Co-founder & violinist",
        "pic": "images/musicians/natalie_sq.webp",
        "bio": "Praised by the New York Times for her \"splendid playing,\" Natalie Rose Kress is a violinist based in Washington, D.C. Following three summers as a Tanglewood Fellow, she was awarded the Jules C. Reiner Violin Prize from the Tanglewood Music Center and performed with Yo-Yo Ma at the 2015 Kennedy Center Honors. She was awarded the 2021 Mercury Chamber Orchestra Fellowship, The 2022 English Concert in America Fellowship, as well as performed the world premiere of Leonard Bernstein's \"Music for String Quartet\" at the Linde Center at The Tanglewood Music Center in 2021 with members of the Boston Symphony Orchestra. She performs as a core member of Quartet Salonnières (NY), Repast Baroque Ensemble (NY), La Grande Bande (MN), and Musicivic Baroque (PA) and can be seen playing with The Handel and Haydn Society (MA), the Washington Bach Consort (D.C.), The English Concert (U.K.), Opera Lafayette (D.C.), The Mercury Chamber Orchestra (TX), Seraphic Fire (FL), TENET Vocal Artists (NY), Early Music NY, and the Staunton Music Festival (VA). She is currently a Doctorate student at the University of Maryland with a focus on Historical Performance pedagogy."
    },
    {
        "name": "Rebecca Nelson",
        "title": "Co-founder & violinist",
        "pic": "images/musicians/rebecca_sq.webp",
        "bio": "Rebecca Nelson (she/her/hers) is a songwriter from Gera, Germany. Born into a family of classical musicians, she began practicing violin at age four and absorbed a healthy diet of Bach, Phil Collins, and Gillian Welch. After earning her Bachelor’s at Rice University and a Master’s at the University of Oklahoma, Rebecca diverged from her classical violin training, diving head first into the enchanting world of Historical Performance. Through her new love of baroque music and old love of folk and bluegrass, Rebecca found her voice as a composer. Since graduating from The Juilliard School’s Historical Performance program, she has joined and founded exciting new ensembles including Nuova Pratica and Digital Camerata. Her debut album Do Not Lament will be released later this year. Aside from writing and performing music, Rebecca enjoys taking long naps with her cat, Momo, and salsa dancing."
    },
    {
        "name": "Robert Warner",
        "title": "Harpsichordist",
        "pic": "images/musicians/robert_sq.webp",
        "bio": "Native Pennsylvanian Robert Warner began his musical studies on piano and violin at a young age with faculty of Bucknell University.  He holds bachelors degrees in music and mathematics from the University of Rochester and became interested in historical performance while exploring the harpsichord and baroque violin at the Eastman School of Music as a college student.  Robert then studied harpsichord extensively with Arthur Haas at Stony Brook University, earning masters and doctoral degrees, before being accepted into Juilliard's Historical Performance program.  At Juilliard he continued his studies with Peter Sykes, Richard Egarr and Beatrice Martin and performed under William Christie, Jordi Savall and others, on both harpsichord and baroque viola.  Robert now resides in New York City where he continues to be an active performer and teacher.  He is the founder, director and harpsichordist of the period-instrument string ensemble New Amsterdam Consort."
    },
    {
        "name": "Sue Yelanjian",
        "title": "Double bassist",
        "pic": "images/musicians/sue_sq.webp",
        "bio": "Sue Yelanjian is the Principal Bassist for Apollo's Fire, The Cleveland Baroque Orchestra. She also performs with Tafelmusik, Handel and Haydn, North Carolina Baroque Orchestra and Indy Baroque. She attended Oberlin Conservatory and received degrees from the Cleveland Institute of Music and Boston University. She appears on numerous recordings on the Koch, Analekta, Electra and CBC labels."
    },
    {
        "name": "Toma Iliev",
        "title": "Co-founder & violinist",
        "pic": "images/musicians/toma_sq.webp",
        "bio": "Bulgarian violinist Toma Iliev began his musical studies at the age of four when, inspired by his older sister’s example, he started taking piano lessons. But at the age of six sibling rivalry led him to another instrument - the violin. Growing up Toma was fascinated by Antonio Vivaldi’s music - specifically the violin and bassoon concerti - which he listened to on vinyl before it was cool. His passion for early music led Toma to Indiana University where he was introduced to the baroque violin by Stanley Ritchie, and later to the Juilliard School’s Historical Performance program. Toma enjoys a vibrant career as a soloist, chamber, and orchestral musician. He regularly performs with leading early music ensembles including Handel and Haydn Society, Philharmonia Baroque Orchestra, American Bach Soloists, and Portland Baroque Orchestra. Toma is a core member of Sonnambula who served as the Metropolitan Museum of Art’s 2018-19 Ensemble in Residence, and he recently appeared with Joyce DiDonato and Il Pomo d’Oro for performances across the United States and Canada. Toma holds several honors and awards, most notably the Leipzig International Bach Competition’s 2014 Christa Bach-Marschall Foundation Prize, and the 2021 Jeffrey Thomas award. When not performing Toma can be found hiking, trail running, and mushroom hunting in the verdant forests of the Pacific Northwest."
    }
]